{
  "home": {
    "get_started": "Начните, отредактировав src/app/page.tsx.",
    "save_instant": "Сохраните и сразу увидите изменения.",
    "deploy": "Развернуть сейчас",
    "docs": "Читать документацию",
    "learn": "Учиться",
    "examples": "Примеры",
    "go_to_next": "Перейти на nextjs.org →"
  },
  "header": {
    "home": "Главная",
    "about": "Опыт работы",
    "projects": "Проекты",
    "contact": "Связаться со мной",
    "resume": "Резюме"
  },
  "portfolio": {
    "title": "Моё портфолио",
    "about": "Обо мне",
    "projects": "Проекты",
    "contact": "Связаться со мной",
    "blog": "Блог"
  },
  "project": {
    "project1": "Приложение-галерея",
    "project1_desc": "Сайт позволяет загружать, выгружать фотографии, ставить лайки на фотографии, выгружать информацию архивом и смотреть рандомные фотографии из всего списка. Добавлена простейшая авторизация логин/пароль:123",
    "project1_tech": "React 18, Express, Multer, Archiver js, Fs-extra",
    "project1_link": "https://photoapp-frontend-gvmw.onrender.com/",
    "project2": "Приложение-портфолио",
    "project2_desc": "Сайт содержит разделы «Обо мне», «Проекты», «Контакты» и блог. Интерфейс поддерживает английский и русский языки и включает простые анимации при переходах между страницами.",
    "project2_tech": "Next.js 15, React 19, TypeScript, i18next, react-i18next, CSS Modules, Jest, Testing Library",
    "project2_link": "#",
    "project3": "Новостная лента",
    "project3_desc": "Отображение карточек новостей с бесконечным скороллом",
    "project3_tech": "React, Redux toolkit, Ant Design",
    "project3_link": "https://posts-mauve.vercel.app/",
    "project4": "Анимированные карточки товара",
    "project4_desc": "Анимированное отображение товара, его характеристик и плавный переход",
    "project4_tech": "NextJS, TypeScript, Tailwind, Framer Motion",
    "project4_link": "https://animation-psi-lemon.vercel.app/",
    "project5": "Карточки с товаром",
    "project5_desc": "Отображение карточек с товаром",
    "project5_tech": "React, TypeScript",
    "project5_link": "https://product-card-omega-lovat.vercel.app/",
    "project6": "Лента новостей",
    "project6_desc": "Проект реализует все принципы CRUD. Данные хранятся в localstorage, есть мобильная адаптация",
    "project6_tech": "React",
    "project6_link": "https://news-feed-orcin.vercel.app/",
    "project7": "Список дел",
    "project7_desc": "Показывает список дел, тут можно добавить задачи, выполнить их, отсортировать и найти необходимый",
    "project7_tech": "Vue3, Pinia",
    "project7_link": "https://to-do-list-phi-dun.vercel.app/",
    "link": "Ссылка"
  },
  "about": {
    "avatar_alt": "Мой аватар",
    "fio": "Ермолин Даниил Александрович",
    "header_fio": "ФИО:",
    "age": "24 года",
    "header_age": "Возраст:",
    "phone": "89111002805",
    "header_phone": "Телефон:",
    "tg_link": "https://t.me/Borbos0",
    "tg": "Телеграм",
    "github_link": "https://github.com/Borbos0",
    "github": "Гитхаб",
    "mail": "nbmvc021@mail.ru",
    "header_mail": "Почта:",
    "city": "Санкт-Петербург",
    "header_city": "Город:",
    "skills": "Навыки",
    "about": "Являюсь Frontend-разработчик с сильным фокусом на качество интерфейса и пользовательский опыт. Имею коммерческий опыт в продуктивных командах, где успешно решал задачи на React и TypeScript, взаимодействуя с REST API и сложными состояниями через Redux Toolkit. Быстро осваиваю новые технологии, самостоятельно изучаю best practices и backend-инфраструктуру для лучшего понимания всей системы. Умею выстраивать архитектуру компонентов с упором на переиспользуемость и масштабируемость, не боюсь брать ответственность за критичные участки проекта. В работе ценю ясность, внимательность к деталям и инженерный подход. Стремлюсь не только реализовывать бизнес-логику, но и улучшать DX, кодовую базу и процессы команды.",
    "skill1": "JavaScript",
    "skill2": "React",
    "skill3": "TypeScript",
    "skill4": "Redux",
    "skill5": "Docker",
    "skill6": "Next.js",
    "skill7": "HTML5",
    "skill8": "CSS3",
    "skill9": "PostgreSQL",
    "skill10": "VueJS",
    "skill11": "Angular",
    "skill12": "Tailwind CSS",
    "skill13": "Git",
    "skill14": "NodeJS",
    "skill15": "jQuery",
    "skill16": "Oracle",
    "skill17": "PHP"
  },
  "resume": {
    "title": "Frontend разработчик",
    "previous_jobs": "Предыдущие места работы",
    "tech": "Технологии:",
    "responsibilities": "Мои обязанности:",
    "job1_title": "ООО «ИТЛаб»",
    "job1_link": "https://itlab-pro.ru/",
    "job1_experience": "5 месяцев",
    "job1_about": "Компания занимается разработкой ЛК для букмекера, поддержанием и разработкой новый фич",
    "job1_point1": "Разрабатывал новые фичи для личного кабинета: реализация страницы терминологии, внедрение выбора и автоматического определения таймзоны с учётом разных пользовательских сценариев.",
    "job1_point2": "Выполнял адаптивную и кроссбраузерную вёрстку на React (TypeScript) с использованием Tailwind CSS, интегрировал фронтенд с backend на Java/PostgreSQL через REST API в условиях ограниченной документации.",
    "job1_point3": "Работал с внешним дизайнером: ставил задачи, уточнял макеты, контролировал реализацию UI.",
    "job1_point4": "Принимал участие в миграции проекта: переходил с классовых React-компонентов и устаревшего Redux на современный компонентный подход с Redux Toolkit, унифицировал структуру приложения.",
    "job1_point5": "Внедрял unit-тестирование с использованием Jest (покрытие — 10–20%), проводил рефакторинг и оптимизацию архитектуры.",
    "job1_point6": "Участвовал в обсуждении архитектурных и процессных решений, работал в тесном взаимодействии с backend-разработчиками и заказчиком, предлагал улучшения для повышения устойчивости и поддерживаемости проекта.",
    "job1_tech": "React, TypeScript, Redux Toolkit, Tailwind CSS, Jest, Webpack, Rollup, Java, PostgreSQL",
    "job2_title": "ООО «РЕШЕНИЕ»",
    "job2_link": "https://xn----8sbaatuc2ap0ai.xn--p1ai/",
    "job2_experience": "2 года 4 месяца",
    "job2_about": "Компания разрабатывает и сопровождает медицинские информационные системы (МИС), занимается созданием автоматизированных рабочих мест (АРМ)",
    "job2_point1": "Разработка сайта-визитки на Vue 3 с TypeScript: создание динамических форм, отправка данных на backend, резиновая и адаптивная вёрстка.",
    "job2_point2": "Интеграция ejs для динамической генерации медицинских протоколов и отчётов: проектирование и внедрение шаблонов, экспорт документов, интеграция с Angular/Material UI.",
    "job2_point3": "Поддержка личного кабинета на Angular с доработкой функционала: багфиксы, добавление новых сценариев, улучшение интерфейса для пользователей.",
    "job2_point4": "Опыт создания SPA-прототипов с нуля (схожих с работой АРМ) на React (TypeScript): интерактивные формы, авторизация, взаимодействие с API, проработка архитектуры, внедрение unit-тестирования с Jest.",
    "job2_point5": "Разработка приложения для планшетов: электронная очередь, интеграция с backend через WebSocket, обработка событий, обеспечение стабильной работы в реальном времени.",
    "job2_point6": "Написание и поддержка docker-compose конфигураций для локальной разработки и деплоя.",
    "job2_point7": "Поддержка и развитие legacy-проектов на jQuery и PHP: оптимизация кода, адаптация интерфейсов под специфические устройства, исправление багов.",
    "job2_point8": "Работа с документацией и администрирование (Laravel/Blade, развертывание Tomcat).",
    "job2_tech": "React, TypeScript, Vue3, Angular, PHP, jQuery, Docker,  Oracle, PostgreSQL"
  },
  "theme": {
    "light": "Светлая тема",
    "dark": "Тёмная тема",
    "toggle": "Переключить тему"
  },
  "404": {
    "header": "Страница не найдена",
    "link": "Вернуться домой"
  }
}
