{
  "404": {
    "header": "Page Not Found",
    "link": "Return Home"
  },
  "home": {
    "get_started": "Get started by editing src/app/page.tsx.",
    "save_instant": "Save and see your changes instantly.",
    "deploy": "Deploy now",
    "docs": "Read our docs",
    "learn": "Learn",
    "examples": "Examples",
    "go_to_next": "Go to nextjs.org →"
  },
  "header": {
    "home": "Home",
    "about": "Work Experience",
    "projects": "Projects",
    "contact": "Contact Me",
    "resume": "Resume"
  },
  "portfolio": {
    "title": "My Portfolio",
    "about": "About Me",
    "projects": "Projects",
    "contact": "Contact Me",
    "blog": "Blog",
    "about_text": "I am a passionate developer creating amazing web solutions.",
    "contact_text": "Get in touch for collaborations or just a friendly chat."
  },
  "project": {
    "project1": "Gallery App",
    "project1_desc": "Photo gallery application. The site allows uploading and downloading photos, liking photos, downloading data as an archive and viewing random photos from the list. Added simple login/password authorization:123",
    "project1_tech": "React 18, Express, Multer, Archiver js, Fs-extra",
    "project1_link": "https://photoapp-frontend-gvmw.onrender.com/",
    "project2": "Portfolio App",
    "project2_desc": "Portfolio application. The site contains sections 'About me', 'Projects', 'Contacts' and a blog. The interface supports English and Russian languages and includes simple animations when navigating between pages.",
    "project2_tech": "Next.js 15, React 19, TypeScript, i18next, react-i18next, CSS Modules, Jest, Testing Library",
    "project2_link": "https://photoapp-frontend-gvmw.onrender.com/",
    "project3": "News Feed",
    "project3_desc": "Display of news cards with infinite scroll",
    "project3_tech": "React, Redux toolkit, Ant Design",
    "project3_link": "https://posts-mauve.vercel.app/",
    "project4": "Animated Product Cards",
    "project4_desc": "Animated display of a product with its characteristics and a smooth transition",
    "project4_tech": "NextJS, TypeScript, Tailwind, Framer Motion",
    "project4_link": "https://animation-psi-lemon.vercel.app/",
    "project5": "Product Cards",
    "project5_desc": "Display of product cards",
    "project5_tech": "React, TypeScript",
    "project5_link": "https://product-card-omega-lovat.vercel.app/",
    "project6": "News Feed CRUD",
    "project6_desc": "The project implements all CRUD principles. Data is stored in localStorage, there's mobile adaptation",
    "project6_tech": "React",
    "project6_link": "https://news-feed-orcin.vercel.app/",
    "project7": "Todo List",
    "project7_desc": "Shows a list of tasks where you can add tasks, mark them as done, sort and search",
    "project7_tech": "Vue3, Pinia",
    "project7_link": "https://to-do-list-phi-dun.vercel.app/",
    "link": "Link"
  },
  "about": {
    "avatar_alt": "My avatar",
    "fio": "Ermolin Daniil Aleksandrovich",
    "header_fio": "Full name:",
    "age": "24 years old",
    "header_age": "Age:",
    "phone": "89111002805",
    "header_phone": "Phone:",
    "tg_link": "https://t.me/Borbos0",
    "tg": "Telegram",
    "github_link": "https://github.com/Borbos0",
    "github": "GitHub:",
    "mail": "nbmvc021@mail.ru",
    "header_mail": "Mail:",
    "city": "Saint Petersburg",
    "header_city": "City:",
    "skills": "Skills",
    "about": "I’m a Frontend Developer with a strong focus on interface quality and user experience. I have commercial experience working in productive teams, successfully solving tasks using React and TypeScript, integrating with REST APIs, and managing complex state with Redux Toolkit. I quickly adapt to new technologies, independently study best practices, and explore backend infrastructure to better understand the full system. I can design component architecture with an emphasis on reusability and scalability, and I’m not afraid to take responsibility for critical parts of the project. In my work, I value clarity, attention to detail, and an engineering mindset. I strive not only to implement business logic but also to improve developer experience, codebase quality, and team processes.",
    "skill1": "JavaScript",
    "skill2": "React",
    "skill3": "TypeScript",
    "skill4": "Redux",
    "skill5": "Docker",
    "skill6": "Next.js",
    "skill7": "HTML5",
    "skill8": "CSS3",
    "skill9": "PostgreSQL",
    "skill10": "VueJS",
    "skill11": "Angular",
    "skill12": "Tailwind CSS",
    "skill13": "Git",
    "skill14": "NodeJS",
    "skill15": "jQuery",
    "skill16": "Oracle",
    "skill17": "PHP"
  },
  "resume": {
    "title": "Frontend Developer",
    "tech": "Technologies:",
    "responsibilities": "My duties:",
    "previous_jobs": "Previous Jobs",
    "job1_title": "ITLab LLC",
    "job1_link": "https://itlab-pro.ru/",
    "job1_experience": "5 months",
    "job1_about": "The company develops a personal account for a bookmaker, maintaining and creating new features",
    "job1_point1": "Developed new features for the personal account: implemented a terminology page and added timezone selection with automatic detection for different user scenarios.",
    "job1_point2": "Performed responsive cross-browser layout in React (TypeScript) using Tailwind CSS, integrating the frontend with a Java/PostgreSQL backend via REST API with limited documentation.",
    "job1_point3": "Worked with an external designer: assigned tasks, clarified designs and monitored UI implementation.",
    "job1_point4": "Participated in project migration from class-based React components and legacy Redux to a modern component approach with Redux Toolkit, unifying the application structure.",
    "job1_point5": "Introduced unit testing with Jest (coverage 10–20%), refactored and optimized the architecture.",
    "job1_point6": "Took part in discussions of architectural and process decisions, collaborated closely with backend developers and the customer, suggesting improvements to increase project stability and maintainability.",
    "job1_tech": "React, TypeScript, Redux Toolkit, Tailwind CSS, Jest, Webpack, Rollup, Java, PostgreSQL",
    "job2_title": "LLC 'RESHENIE'",
    "job2_link": "https://xn----8sbaatuc2ap0ai.xn--p1ai/",
    "job2_experience": "2 years 4 months",
    "job2_about": "The company develops and maintains medical information systems (MIS) and creates automated workstations (ARM)",
    "job2_point1": "Developed a promo website on Vue 3 with TypeScript: created dynamic forms, sent data to the backend, implemented fluid and responsive layout.",
    "job2_point2": "Integrated ejs for dynamic generation of medical protocols and reports: designed and implemented templates, exported documents, integrated with Angular/Material UI.",
    "job2_point3": "Maintained a personal account on Angular adding functionality: bug fixes, new scenarios, interface improvements.",
    "job2_point4": "Created SPA prototypes from scratch (similar to ARM) with React (TypeScript): interactive forms, authentication, API interaction, architecture design, added unit testing with Jest.",
    "job2_point5": "Developed a tablet application: electronic queue, integration with the backend via WebSocket, event handling, ensuring stable real-time work.",
    "job2_point6": "Wrote and maintained docker-compose configurations for local development and deployment.",
    "job2_point7": "Supported and improved legacy projects on jQuery and PHP: optimized code, adapted interfaces for specific devices, fixed bugs.",
    "job2_point8": "Worked with documentation and administration (Laravel/Blade, Tomcat deployment).",
    "job2_tech": "React, TypeScript, Vue3, Angular, PHP, jQuery, Docker,  Oracle, PostgreSQL"
  },
  "theme": {
    "light": "Light Mode",
    "dark": "Dark Mode",
    "toggle": "Toggle theme"
  },
  "blog": {
    "title": "Blog"
  }
}
